package com.undefinedus.backend.domain.enums;

public enum PreferencesType {
    소설,            // 소설 카테고리
    예술대중문화,     // 예술 카테고리
    가정육아,        // 가정/육아 카테고리
    시,              // 시 카테고리
    인터넷,          // 인테리어 카테고리
    여행,            // 여행 카테고리
    요리,            // 요리 카테고리
    에세이,          // 에세이 카테고리
    경제경영,        // 경제경영 카테고리
    자기계발,        // 자기계발 카테고리
    인문학,          // 인문학 카테고리
    취미레저,        // 취미/레저 카테고리
    종교,            // 종교 카테고리
    사회과학,        // 사회과학 카테고리
    역사,            // 역사 카테고리
    과학,            // 과학 카테고리
    만화,            // 만화 카테고리
    자서전,          // 자서전 카테고리
    컴퓨터IT,        // 컴퓨터/IT 카테고리
    청소년,          // 청소년 카테고리
    건강스포츠,      // 건강/스포츠 카테고리
    외국어           // 외국어 카테고리
}